//
//  Data.swift
//  AhmedSoloApp
//
//  Created by Ahmed Assiri on 23/04/1443 AH.
//

import UIKit



struct Item {
    let name : String
    let price1 : String
    let logo : UIImage?
    let spe : String
}

var importing : Array<Item> = []
var cart : Array<Item> = []
var purchsedPr : Array<Item> = []


var List : Array<Item> = [
    Item(
        name: "الغفار",
        price1 : "",
        logo: UIImage(named: "الغفار"),
        spe : " اسم الله الغفار من أسماء الله الحسني، هو من صيغ المبالغة، على وزن فعال، أي كثير المغفرة، كماً ونوعاً، وأصل المغفرة التغطية والستر."
    ),
    Item(
        name: "المصور",
        price1 : "",
        logo: UIImage(named: "المصور"),
        spe : " اسم الله المصور هو أحد أسماء الله الحسنى، ومعناه: الذي خلق خلقه كيف شاء، وصور جميع الموجودات ورتبها فأعطى كل شيء منها صورة خاصة وهيئة مفردة يتميز بها على اختلافها وكثرتها، وصوّر كل صورة لا على مثال احتذاه ولا رسم ارتسمه."
    ),
    Item(
        name: "الحي",
        price1 : "",
        logo: UIImage(named: "الحي"),
        spe : " الحي من أسماء الله الحسنى في الإسلام، ومعناه: الذي له كمال الحياة، والذي لا يموت."
    ),
    Item(
        name: "النافع",
        price1 : "",
        logo: UIImage(named: "النافع"),
        spe : "النافع الذي يصدر منه الخير والنفع في الدنيا والآخرة قال الله﴿يَدْعُو لَمَنْ ضَرُّهُ أَقْرَبُ مِنْ نَفْعِهِ) "
        
    ),
    Item(
        name: "السلام",
        price1 : "",
        logo: UIImage(named: "السلام"),
        spe : " السلام هو اسم من أسماء الله الحسنى، ومعناه الذي سلم من العيوب والنقائص ووصفه بالسلام أبلغ في ذلك من وصفه بالسالم، ومن موجبات وصفه بذلك سلامة خلقه من ظلمه لهم، فسلم سبحانه من إرادة الظلم والشر والعبث وخلاف الحكمة ومن التسمية به ومن فعله ومن نسبته إليه، فهو السلام من صفات النقص وأفعال النقص"
        
    ),
    Item(
        name: "الملك",
        price1 : "",
        logo: UIImage(named: "الملك"),
        
        spe : "الملك هو أحد أسماء الله الحسنى في الإسلام.  "
        
    ),
    Item(
        name: "المميت",
        price1 : "",
        logo: UIImage(named: "المميت"),
        spe : "المميت هو صفة من صفات الله في الإسلام، وهي صفة ثابتة في القرآن والسنة النبوية، فالمحيي والمميت صفتان فعليتان خاصتان بالله، ومعناه: أن الله هو الذي بيده الموت، فهو الذي يميت الأحياء."
        
    ),
    Item(
        name: "العظيم",
        price1 : "",
        logo: UIImage(named: "العظيم"),
        spe :" العظيم هو من أسماء الله الحسنى، وهو من صيغ المبالغة، ومعناه: الذي يعظمه خلقه ويهابونه ويتقونه، فله صفة العظمة في كل شيء."
        
    ),
    Item(
        name: "المجيب",
        price1 : "",
        logo: UIImage(named: "المجيب"),
        spe : "المجيب هو من أسماء الله الحسنى، اسم فاعل، ومعناه: الذي يجيب دعاء عباده. "
    ),
    Item(
        name: "الوهاب",
        price1 : "",
        logo: UIImage(named: "الوهاب"),
        spe : "الوهَّاب من أسماء الله الحسنى ،ومعناه :الذي شمل الكائنات بأسرها ببره وهباته وكرمه، فهو مولى الجميل ودائم الإحسان وواسع المواهب، وصفه البر وآثار هذا الوصف جميع النعم الظاهرة والباطنة، فلا يستغني مخلوق عن إحسانه وبره طرفة عين. "
    ),
    Item(
        name: "الصمد",
        price1 : "",
        logo: UIImage(named: "الصمد"),
        spe : " الصمد من أسماء الله الحسنى في الإسلام، ومعناه: السيد الذي تصمدُ إليه الخلائق في حاجاتها، ترجوه وتسأله وتضرع إليه حاجاتها، وقيل أن معناه:الذي لا جوف له."
    ),
    Item(
        name: "الوارث",
        price1 : "",
        logo: UIImage(named: "الوارث"),
        spe : "الوارث هو من أسماء الله الحسنى، ومعناه: الباقي بعد فناء الخلق الذي يرث السماوات والأرض وما فيهما بعد موت الخلائق وانتهائها، وقد يطلق على الإنسان في حال إرثه مالاً من ميت. "
    ),
    Item(
        name: "الباقي",
        price1 : "",
        logo: UIImage(named: "الباقي"),
        spe : "الباقي هو من أسماء الله الحسنى المختلف عليها التي لم ترد في القرآن أو السنة ، ومعناه : الحيُّ الباقي على الدوام. "
    ),
    Item(
        name: "الاخر",
        price1 : "",
        logo: UIImage(named: "الاخر"),
        spe : " الآخر هو من أسماء الله الحسنى في الإسلام، ويعني أنه الذي لا شيء بعده، وأنه الذي لا انتهاء له، والذي يرجع إليه كل شيء وتنتهي إليه أمور الخلائق كلها"
    ),
    Item(
        name: "الشكور",
        price1 : "",
        logo: UIImage(named: "الشكور"),
        spe : "الشكور من أسماء الله الحسنى على وزن فعول بصيغة المبالغة، ومن أسماء الله الحسنى أيضًا الشاكر، ومعناه:أن الشكور هو الذي يزكو عنده القليل من أعمال العباد فيضاعف لهم الجزاء، فشكره لعباده مغفرته لهم. "
    ),
    Item(
        name: "الرشيد",
        price1 : "",
        logo: UIImage(named: "الرشيد"),
        spe : "الرشيد, وهو الذي أرشد الخلق إلى مصالحهم، أي: هداهم ودلهم عليها "
    ),
    Item(
        name: "الشهيد",
        price1 : "",
        logo: UIImage(named: "الشهيد"),
        spe : " الشهيد هو اسم من أسماء الله الحسنى، على وزن فعيل بصيغة المبالغة، ومعناه: هو الذي لا يغيب عن علمه شيء، وهو أيضًا الذي يشهد على الخلق يوم القيامة، وهو قريب من معنى الرقيب."
    ),
    Item(
        name: "المبدئ",
        price1 : "",
        logo: UIImage(named: "المبدئ"),
        spe : " المبدئ: أن الله بدأ الخلق من العدم إلى الوجود، فأحسن كل شيء خلقه بتقدير وتدبير وعلم."
    ),
    Item(
        name: "اللطيف",
        price1 : "",
        logo: UIImage(named: "اللطيف"),
        spe : "اللطيف هو من أسماء الله الحسنى، وهو من صيغ المبالغة، ومعناه: الذي يعلم دقائق الأمور وخفاياها، وما في الضمائر والصدور، والذي يحسن إلى عباده من حيث لا يحتسبون . "
    ),
    Item(
        name: "الرحمن",
        price1 : "",
        logo: UIImage(named: "الرحمن"),
        spe : "الرحمن من أسماء الله الحسنى المتعلقة به وحده لا شريك له، فكل خير للعباد ينسب له ولرحمته والاعتقاد أن ما نزل من رحمته فهو قدر وجزء بسيط من ما سخرها الله لعباده في الجنة وما أنزله من رحمة فهو رحمة لجميع الخلائق من الجن والأنس ومن خلقه الذين نعلمهم ولا نعلمهم من حيوانات وغيرها. "
    ),
    Item(
        name: "الاول",
        price1 : "",
        logo: UIImage(named: "الاول"),
        spe : " الأول هو من أسماء الله الحسنى، ومعناه: الذي لم يسبقه شيء، فلا شيء قبله، فعن عمران بن الحصين أن النبي قَال: «كَانَ اللهُ وَلمْ يَكُنْ شَيْءٌ قَبْلهُ، وَكَانَ عَرْشُهُ عَلى المَاءِ، ثُمَّ خَلقَ السَّمَأوَاتِ وَالأرْض، وَكَتَبَ فِي الذِّكْرِ كُل شَيْءٍ»وهذا الترتيب لوجود المخلوقات في متوالية مستمرة غير متناهية من الأزل ..."
    ),
    Item(
        name: "الولي",
        price1 : "",
        logo: UIImage(named: "الولي"),
        spe : " الوَلِّيُ هو اسم من أسماء الله الحسنى، ومعناه: المتولي للأمر والقائم به، نصير المؤمنين وظهيرهم."
    ),
    Item(
        name: "المذل",
        price1 : "",
        logo: UIImage(named: "المذل"),
        spe : " "
    ),
    Item(
        name: "العليم",
        price1 : "",
        logo: UIImage(named: "العليم"),
        spe : " "
    ),
    Item(
        name: "المؤمن",
        price1 : "",
        logo: UIImage(named: "المؤمن"),
        spe : " "
    ),
    Item(
        name: "المهيمن",
        price1 : "",
        logo: UIImage(named: "المهيمن"),
        spe : " "
    ),
    Item(
        name: "القدوس",
        price1 : "",
        logo: UIImage(named: "القدوس"),
        spe : " "
    ),
    Item(
        name: "الخبير",
        price1 : "",
        logo: UIImage(named: "الخبير"),
        spe : " "
    ),
    Item(
        name: "النتقم",
        price1 : "",
        logo: UIImage(named: "المنتقم"),
        spe : " "
    ),
    Item(
        name: "البر",
        price1 : "",
        logo: UIImage(named: "البر"),
        spe : " "
    ),
    Item(
        name: "القابض",
        price1 : "",
        logo: UIImage(named: "القابض"),
        spe : " "
    ),
    Item(
        name: "الباسط",
        price1 : "",
        logo: UIImage(named: "الباسط"),
        spe : " الباسط اسم من أسماء الله الحسنى، وهو اسم الفاعل من بسط يبسط فهو باسط، أي يقتر على من يشاء ويوسع على من يشاء على حسب ما يرى من المصلحة لعباده. فالقبض هنا: التقتير والتضييق. والبسط التوسعة في الرزق والإكثار منه. فالله عز وجل القابض الباسط يقتر على من يشاء ويوسع على من يشاء."
    ),
    Item(
        name: "المحصي",
        price1 : "",
        logo: UIImage(named: "المحصي"),
        spe : "المحصي هو الذي احصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل. "
    )
]

